Revit 2027 API
KeyBasedTreeEntries.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<KeyBasedTreeEntry> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of KeyBasedTreeEntry)
public:
virtual IEnumerator<KeyBasedTreeEntry^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<KeyBasedTreeEntry>
override GetEnumerator : unit -> IEnumerator<KeyBasedTreeEntry>
Return Value
IEnumerator<KeyBasedTreeEntry>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace